credit_engine/app/controllers/api/v1/currencies_controller.rb

      def index
        currencies = Currency.all.order(:code)
---
SELECT "currencies".* FROM "currencies" ORDER BY "currencies"."code" ASC