credit_engine/app/controllers/api/v1/exchange_rates_controller.rb

      def index
        rates = ExchangeRate.includes(:from_currency, :to_currency)
                            .order(reference_date: :desc, created_at: :desc)
                            .limit(50)
---
SELECT "currencies".* FROM "currencies" WHERE "currencies"."id" IN (1, 2)
SELECT "exchange_rates".* FROM "exchange_rates" ORDER BY "exchange_rates"."reference_date" DESC, "exchange_rates"."created_at" DESC LIMIT 50

      def create
        from_curr = Currency.find_by!(code: exchange_rate_params[:from_currency_code])
        to_curr = Currency.find_by!(code: exchange_rate_params[:to_currency_code])
        rate = BigDecimal(exchange_rate_params[:rate].to_s)
        ref_date = exchange_rate_params[:reference_date].present? ? Date.parse(exchange_rate_params[:reference_date]) : Date.today

        if rate <= 0
          raise "A taxa cambial deve ser maior que zero."
        end

        # Use transaction to save both direct and reverse rates
        ActiveRecord::Base.transaction do
          # 1. Save direct rate
          @rate_direct = ExchangeRate.find_or_initialize_by(
            from_currency: from_curr,
            to_currency: to_curr,
            reference_date: ref_date
          )
---
SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = $1 LIMIT $2  [["code", "USD"], ["LIMIT", 1]]
SELECT "exchange_rates".* FROM "exchange_rates" WHERE "exchange_rates"."from_currency_id" = $1 AND "exchange_rates"."to_currency_id" = $2 AND "exchange_rates"."reference_date" = $3 LIMIT $4  [["from_currency_id", 30], ["to_currency_id", 29], ["reference_date", "2026-06-09"], ["LIMIT", 1]]