credit_engine/app/controllers/api/v1/operations_controller.rb

SELECT "receivables".* FROM "receivables" WHERE "receivables"."operation_id" = 1
INSERT INTO "operations" ("assignee", "payment_currency_id", "total_face_value", "total_net_value", "created_at", "updated_at") VALUES ('Empresa teste', 1, 3000.0, 2893.9507, '2026-06-08 14:26:07.107863', '2026-06-08 14:26:07.107863') RETURNING "id"
INSERT INTO "receivables" ("operation_id", "receivable_type_id", "currency_id", "identifier", "face_value", "net_value", "due_date", "days_to_maturity", "spread_applied", "base_rate_applied", "exchange_rate_applied", "created_at", "updated_at") VALUES (1, 1, 1, 'TIT-01', 1000.0, 970.8738, '2026-07-08', 30, 0.015, 0.015, NULL, '2026-06-08 14:26:07.111572', '2026-06-08 14:26:07.111572') RETURNING "id"
---
      def create
        # 1. Run calculations through Strategy Pattern Pricing Engine
        data = PricingEngine::Calculator.calculate_operation(
          assignee: operation_params[:assignee],
          payment_currency_code: operation_params[:payment_currency_code],
          receivables: (operation_params[:receivables] || []).map(&:to_h),
          base_rate: operation_params[:base_rate] || 0.0
        )

        # 2. Build the ActiveRecord objects
        @operation = Operation.new(
          assignee: data[:assignee],
          payment_currency_id: data[:payment_currency_id],
          total_face_value: data[:total_face_value],
          total_net_value: data[:total_net_value]
        )

        data[:receivables_attributes].each do |rec_attr|
          @operation.receivables.build(rec_attr.except(:net_value_original))
        end

        # 3. Save inside a database transaction to ensure ACID atomic property
        ActiveRecord::Base.transaction do
          @operation.save!