credit_engine/app/controllers/api/v1/operations_controller.rb

      def create
        # 1. Resolve payment currency
        currency = Currency.find_by!(code: operation_params[:payment_currency_code])

        # 2. Build pending operation
        @operation = Operation.new(
          assignee: operation_params[:assignee],
          payment_currency: currency,
          total_face_value: 0.0,
          total_net_value: 0.0,
          status: "pending"
        )

        # 3. Save pending operation record
        ActiveRecord::Base.transaction do
          @operation.save!
        end

        # 4. Enqueue background settlement job
        SettleOperationJob.perform_later(
          @operation.id,
          operation_params[:base_rate] || 0.0,
          (operation_params[:receivables] || []).map(&:to_h)
        )
---
SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = 'BRL' LIMIT 1
SELECT "receivables".* FROM "receivables" WHERE "receivables"."operation_id" = 1