credit_engine/app/controllers/api/v1/receivable_types_controller.rb

      def index
        types = ReceivableType.all.order(:name)
---
SELECT "receivable_types".* FROM "receivable_types" ORDER BY "receivable_types"."name" ASC