credit_engine/app/services/pricing_engine/calculator.rb

SELECT "receivable_types".* FROM "receivable_types" WHERE "receivable_types"."code" = 'duplicata' LIMIT 1
---
    def self.calculate_receivable(identifier: nil, face_value:, due_date:, receivable_type_code:, currency_code:, payment_currency_code:, base_rate: 0.0, operation_date: Date.today)
      face_value = BigDecimal(face_value.to_s)
      base_rate = BigDecimal(base_rate.to_s)
      due_date = due_date.to_date
      operation_date = operation_date.to_date

      # Validate date
      days = (due_date - operation_date).to_i
      if days < 0
        raise "Data de vencimento (#{due_date}) não pode ser anterior à data da operação (#{operation_date})"
      end

      prazo_meses = days / 30.0

      # Fetch ReceivableType and spread
      type_record = ReceivableType.find_by!(code: receivable_type_code)

SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = 'BRL' LIMIT 1
---
      end

      {
        identifier: identifier,
        face_value: face_value.to_f,
        net_value_original: net_value_original.to_f,
        net_value: net_value_payment.to_f,
        due_date: due_date,
        days_to_maturity: days,
        spread_applied: spread_applied.to_f,
        base_rate_applied: base_rate.to_f,
        exchange_rate_applied: exchange_rate,
        receivable_type_id: type_record.id,
        currency_id: Currency.find_by!(code: currency_code).id

SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = 'USD' LIMIT 1
---
    def self.calculate_operation(assignee:, payment_currency_code:, receivables:, base_rate: 0.0, operation_date: Date.today)
      payment_curr = Currency.find_by!(code: payment_currency_code)

SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = 'BRL' LIMIT 1
SELECT "currencies".* FROM "currencies" WHERE "currencies"."code" = 'USD' LIMIT 1
SELECT "exchange_rates".* FROM "exchange_rates" WHERE "exchange_rates"."from_currency_id" = 19 AND "exchange_rates"."to_currency_id" = 20 AND (reference_date <= '2026-06-08') ORDER BY "exchange_rates"."reference_date" DESC LIMIT 1
---
    def self.find_exchange_rate(from_code, to_code, date)
      return 1.0 if from_code == to_code

      from_curr = Currency.find_by(code: from_code)
      to_curr = Currency.find_by(code: to_code)

      raise "Moeda de origem não encontrada: #{from_code}" unless from_curr
      raise "Moeda de destino não encontrada: #{to_code}" unless to_curr

      # Find closest exchange rate equal or prior to the date
      rate_record = ExchangeRate.where(from_currency: from_curr, to_currency: to_curr)
                               .where("reference_date <= ?", date)
                               .order(reference_date: :desc)
                               .first